Tekla Open API Reference for Tekla Structures 2025
PluginBase Properties
The PluginBase type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the executable plug-in instance.
Top
See Also
Reference
PluginBase Class
Tekla.Structures.Plugins Namespace